azogue/hass_config/esp8266_sensors/mqtt_pir_vibro_light_dht22_publisher.c
/*
# *Detector de movimiento, vibración, luz, temperatura y humedad relativa*

*Detector inalámbrico de movimiento, vibración, luz, temperatura y humedad relativa* sobre plataforma ESP8266,
que comunica los valores detectados a un servidor MQTT (like `mosquitto`). Útil para colocarlo en recintos alejados
pero con acceso a wifi en integraciones de domótica.

De funcionamiento muy sencillo, se conecta a la wifi local, y de ahí al servidor MQTT, donde publica los valores
de temperatura, humedad y porcentaje de iluminación cada X segundos
(`MQTT_POSTINTERVAL_LIGHT_SEC` & `MQTT_POSTINTERVAL_DHT22_SEC`).
Los sensores binarios (movimiento, vibración e iluminación) se tratan mediante interrupciones (vs polling)
y publican estados de 'on'/'off' en cuanto se produce un evento de activación.

Componentes:
  - ESP8266 mcu 1.0 dev kit / ESP32 Dev Kit
  - DHT22 sensor
  - PIR sensor
  - Vibration sensor
  - Light sensor (with AO + DO)
  - RGBLED + 3 resistors

Edita, al menos, estos valores con tu configuración particular y flashea el programa con el Arduino IDE:
```
//WiFi Settings
#define WiFiSSID                            [REDACTED_WIFI_SSID]
#define WiFiPSK                             [REDACTED_WIFI_PASSWORD]

//MQTT Server Settings
#define MQTT_SERVER                         [REDACTED_MQTT_SERVER_IP]
#define MQTT_PORT                           [REDACTED_MQTT_SERVER_PORT]
#define MQTT_USER                           [REDACTED_MQTT_USER]
#define MQTT_PASSWORD                       [REDACTED_MQTT_PASSWD]
```

Si quieres editar los MQTT `topic`'s de cada sensor, cambia también estos:
```
#define mqtt_temp_topic                     "sensor/temp_"
#define mqtt_humid_topic                    "sensor/hum_"
#define mqtt_movement_topic                 "sensor/pir_"
#define mqtt_vibro_topic                    "sensor/extra_"
#define mqtt_light_topic                    "sensor/light_"
#define mqtt_light_analog_topic             "sensor/light_analog_"
```

Al nombre del `topic` se le añade la MAC de la Wifi del ESP8266 (ej: `sensor/light_analog_abcdef012345`), de forma
que los identificadores son únicos para cada chip, por lo que, si utilizas varios de estos detectores, no hay
necesidad de cambiar el programa para cada uno.

### Changelog ESP8266 MQTT Publisher

- v1.0: PIR+Vibration+Light(AO+DO)+DHT22 sensors publishing values to a local mosquitto server.
- v1.1: Fixed some errors, Better error handling with DHT22, different publish frecuency for light & DHT22,
        negate digital_light sensor, and some refactoring.
- v1.2: Added ESP32 support with a compilation flag, Compiles OK but it's NOT WORKING:
```
  Guru Meditation Error of type LoadProhibited occurred on core  1. Exception was unhandled.
  Register dump:
  PC      : 0x400d1de8  PS      : 0x00060c30  A0      : 0x800d214a  A1      : 0x3ffc7440
  A2      : 0x3ffc1f98  A3      : 0x000000c8  A4      : 0x3f40156f  A5      : 0x3ffc7560
  A6      : 0x3ffc7540  A7      : 0x00000008  A8      : 0x800d83c5  A9      : 0x3ffc7390
  A10     : 0x00000000  A11     : 0x3ffc7486  A12     : 0x00000000  A13     : 0x3f40156f
  A14     : 0x00000000  A15     : 0x00000000  SAR     : 0x0000001f  EXCCAUSE: 0x0000001c
  EXCVADDR: 0x00000000  LBEG    : 0x400014fd  LEND    : 0x4000150d  LCOUNT  : 0xfffffffc

  Backtrace: 0x400d1de8:0x3ffc7440 0x400d214a:0x3ffc7460 0x400d21dd:0x3ffc7580 0x400d1745:0x3ffc75a0 0x400d11a2:0x3ffc75c0 0x400d1227:0x3ffc75e0 0x400de7d2:0x3ffc7610

  CPU halted.
```

*

### Librerías:

- ESP8266WiFi v1.0 || WiFiEsp v2.1.2
- PubSubClient v2.6
- elapsedMillis v1.0.3
- Adafruit_Unified_Sensor v1.0.2
- DHT_sensor_library v1.3.0

*/

//**********************************
//** USER SETTINGS *****************
//**********************************
// MQTT settings
#define MQTT_SERVER                         [REDACTED_MQTT_SERVER_IP]
#define MQTT_PORT                           [REDACTED_MQTT_SERVER_PORT]
#define MQTT_USER                           [REDACTED_MQTT_USER]
#define MQTT_PASSWORD                       [REDACTED_MQTT_PASSWD]
#define MQTT_USERID                         "ESP8266Client"

#define mqtt_temp_topic                     "sensor/temp_"
#define mqtt_humid_topic                    "sensor/hum_"
#define mqtt_movement_topic                 "sensor/pir_"
#define mqtt_vibro_topic                    "sensor/extra_"
#define mqtt_light_topic                    "sensor/light_"
#define mqtt_light_analog_topic             "sensor/light_analog_"

// WiFi Settings
#define WiFiSSID                            [REDACTED_WIFI_SSID]
#define WiFiPSK                             [REDACTED_WIFI_PASSWORD]

//**********************************
//** PINOUT ************************
//** comment to deactivate        **
//**********************************
#define USE_ESP32
#define DHTTYPE                               DHT11  // DHT22 (AM2302) / DHT11

#ifdef USE_ESP32
  #define DHTPIN                              17     //IO17

  //#define LED_BLUE_PIR                      X
  //#define LED_YELLOW_VIBRO                  X
  #define LED_RGB_RED                         2      //IO02
  #define LED_RGB_GREEN                       4      //IO04
  #define LED_RGB_BLUE                        16     //IO16

  #define PIN_PIR                             21     //IO21
  #define PIN_VIBRO                           22     //IO22
  #define PIN_LIGHT_SENSOR_DIGITAL            34     //IO34
  #define PIN_LIGHT_SENSOR_ANALOG             35
#else  // use esp8266
  #define DHTPIN                              2      //D4 (DHT sensor)

  //#define LED_BLUE_PIR                        14     //D5
  //#define LED_YELLOW_VIBRO                    0      //D3

  #define LED_RGB_RED                         12     //D6
  #define LED_RGB_GREEN                       13     //D7
  #define LED_RGB_BLUE                        15     //D8

  #define PIN_PIR                             5      //D1
  #define PIN_VIBRO                           4      //D2
  #define PIN_LIGHT_SENSOR_DIGITAL            14     //D5
  #define PIN_LIGHT_SENSOR_ANALOG             A0     //A0
#endif

//**********************************
//** Configuración *****************
//**********************************
#define VERBOSE

#define MQTT_POSTINTERVAL_DHT22_SEC         40
#define MQTT_POSTINTERVAL_LIGHT_SEC         45

#define DELAY_MIN_MS_ENTRE_MOVS             5000
#define DELAY_MIN_MS_ENTRE_VIBRO_SENSOR     4000
#define DELAY_MIN_MS_ENTRE_LIGHT_SENSOR     3000

#define DELTA_MS_TO_TURN_OFF_MOVS           3000
#define DELTA_MS_TO_TURN_OFF_VIBRO          3000
#define PERSISTENT_STATE_MS_UNTIL_STANDBY   2000

//Settings for recording samples
#define RESULTS_SAMPLE_RATE                 8            // # seconds between samples
#define SENSOR_HISTORY_RECORDS              10           // # records to keep

//**********************************
//** Librerías *********************
//**********************************
#ifdef USE_ESP32
  #include "WiFiEsp.h"
#else
  #include <ESP8266WiFi.h>
#endif
#include <PubSubClient.h>
#include <elapsedMillis.h>
#ifdef DHTPIN
  #include <list>
  #include <Adafruit_Sensor.h>  // - Adafruit Unified Sensor Library: https://github.com/adafruit/Adafruit_Sensor
  #include <DHT.h>              // - DHT Sensor Library: https://github.com/adafruit/DHT-sensor-library
  #include <DHT_U.h>
#endif

//**********************************
//** Variables *********************
//**********************************
#ifdef USE_ESP32
  WiFiEspClient espClient;                       //For the MQTT client
#else
  WiFiClient espClient;                       //For the MQTT client
#endif
PubSubClient client(espClient);             //MQTT client
char MAC_char[18];                          //MAC address in ascii
#define DELAY_MS_BETWEEN_RETRIES            250

#ifdef DHTPIN                               // DHT22/DHT11 sensor settings.
DHT_Unified dht(DHTPIN, DHTTYPE);

// Variables for recording samples of the DHT22 sensor.
std::list<double> tempSamples;   //Collected results per interval
std::list<double> humidSamples;  //Collected results per interval
std::list<double> tempHistory;   //History over time.
std::list<double> humidHistory;  //History over time.
#endif

// Contadores de tiempo
elapsedMillis sinceStart;
int last_sensor_error;
int last_sensor_ok;
int last_dht_sensed;         //The last time a sample was taken from the DHT22 sensor.
int error_counter_dht;

int last_dht22_post;            // Init value to wait some time before the 1st publish.
int last_light_post;            // Init value to wait some time before the 1st publish.

int last_state_change;

// Estados (para el output LED RGB)
#define STATE_ERROR            1
#define STATE_WARN             2
#define STATE_OK_MEASURE       3
#define STATE_OK_PUBLISH       4
#define STATE_INIT             5
#define STATE_STANDBY          7
#define STATE_CRITICAL         8
int current_sensor_state;

// Binary sensors variables for control them within interrupts
volatile int last_pir_trigered = 0;
volatile int last_vibro_trigered = 0;
volatile int last_light_trigered = 0;

volatile bool pir_state = LOW;
volatile bool vibro_state = LOW;
volatile bool light_state = LOW;
bool last_light_post_state = LOW;

volatile bool flag_publish_pir = LOW;
volatile bool flag_publish_vibro = LOW;
volatile bool flag_publish_light = LOW;

//**********************************
//** SETUP
//**********************************
void setup()
{
  uint8_t MAC_array[6];

