azogue/hass_config/esp8266_sensors/mqtt_pir_vibro_light_dht22_publisher.c
  Serial.begin(9600);
  setup_timers();
  setup_leds();
  set_state(STATE_INIT);
  connectWiFi();
#ifdef DHTPIN
  setup_temp_sensor();
#endif
  setup_boolean_sensors();

  //Get the mac and convert it to a string.
  WiFi.macAddress(MAC_array);
  for (int i = 0; i < sizeof(MAC_array); ++i)
  {
    sprintf(MAC_char, "%s%02x", MAC_char, MAC_array[i]);
  }

#ifdef VERBOSE
  Serial.print("MAC ADRESS: ");
  Serial.println(MAC_char);
#endif
  set_state(STATE_CRITICAL);
}

//**********************************
//** LOOP
//**********************************

void loop()
{
  bool sensor_ok = false;
  bool sensed_data = false;

  //Reconnect if disconnected.
  if(WiFi.status() != WL_CONNECTED)
  {
    set_state(STATE_CRITICAL);
    connectWiFi();
  }

  //Check the MQTT connection and process it
  while (!client.connected())
  {
    set_state(STATE_ERROR);
    client.connect(MQTT_USERID, MQTT_USER, MQTT_PASSWORD);
    delay(DELAY_MS_BETWEEN_RETRIES * 2);
  }
  client.loop();

  turn_off_motion_sensors_after_delay();
  publish_motion_and_light_sensors_if_flag_or_delta();
#ifdef DHTPIN
  sample_dht22_sensor_data(&sensed_data, &sensor_ok);
#endif
  if (publish_dht22_sensor_data())
  {
    set_state(STATE_OK_PUBLISH);
  }
  else if (sensed_data && sensor_ok)
  {
    set_state(STATE_OK_MEASURE);
  }
  else if (sensed_data)
  {
    set_state(STATE_WARN);
  }
  else
  {
    auto_standby();
  }
}

//**********************************
//** METHODS
//**********************************

void auto_standby()
{
  if ((sinceStart - last_state_change > PERSISTENT_STATE_MS_UNTIL_STANDBY)
      && current_sensor_state != STATE_STANDBY && !i_state_critical())
  {
    set_state(STATE_STANDBY);
  }
}

void turn_off_motion_sensors_after_delay()
{
#ifdef PIN_PIR
  // PIR binary sensor to off after a delay:
  if (pir_state && (sinceStart - last_pir_trigered > DELTA_MS_TO_TURN_OFF_MOVS))
  {
    pir_state = LOW;
    flag_publish_pir = HIGH;
  }
#endif

#ifdef PIN_VIBRO
  // Vibration binary sensor to off after a delay:
  if (vibro_state && (sinceStart - last_vibro_trigered > DELTA_MS_TO_TURN_OFF_VIBRO))
  {
    vibro_state = LOW;
    flag_publish_vibro = HIGH;
  }
#endif
}

void publish_motion_and_light_sensors_if_flag_or_delta()
{
#ifdef PIN_PIR
  // Update PIR state:
  if (flag_publish_pir)
  {
#ifdef LED_BLUE_PIR
    digitalWrite(LED_BLUE_PIR, pir_state);
#endif
    flag_publish_pir = !publish_mqtt_binary_sensor("MOVEMENT", "MOVEMENT OFF", pir_state,
                                                   (mqtt_movement_topic+String(MAC_char)).c_str());
  }
#endif

#ifdef PIN_VIBRO
  // Update vibro sensor state:
  if (flag_publish_vibro)
  {
#ifdef LED_YELLOW_VIBRO
    digitalWrite(LED_YELLOW_VIBRO, vibro_state);
#endif
    flag_publish_vibro = !publish_mqtt_binary_sensor("VIBRATION", "VIBRATION OFF", vibro_state,
                                                     (mqtt_vibro_topic+String(MAC_char)).c_str());
  }
#endif

#ifdef PIN_LIGHT_SENSOR_DIGITAL
  // Update LIGHT state:
  if (flag_publish_light || (sinceStart - last_light_post > MQTT_POSTINTERVAL_LIGHT_SEC * 1000))
  {
    float light_percentage;

    if (!flag_publish_light)
    {
      light_state = digitalRead(PIN_LIGHT_SENSOR_DIGITAL);
      if (light_state != last_light_post_state)
      {
        last_light_post_state = light_state;
        flag_publish_light = !publish_mqtt_binary_sensor("LIGHT", "LIGHT OFF", !light_state,
                                                         (mqtt_light_topic+String(MAC_char)).c_str());
      }
    }
    else
    {
      last_light_post_state = light_state;
      flag_publish_light = !publish_mqtt_binary_sensor("LIGHT", "LIGHT OFF", !light_state,
                                                       (mqtt_light_topic+String(MAC_char)).c_str());
    }

#ifdef PIN_LIGHT_SENSOR_ANALOG
    light_percentage = read_analog_light_percentage();
    flag_publish_light = !publish_mqtt_data("LIGHT", (mqtt_light_analog_topic+String(MAC_char)).c_str(),
                                            String(light_percentage).c_str(), false);
#endif

    if (!flag_publish_light)
      last_light_post = sinceStart;
  }
#endif
}

bool publish_dht22_sensor_data()
{
#ifdef DHTPIN
  //post MQTT DHT22 data every X seconds
  if ((error_counter_dht == 0) && (sinceStart - last_dht22_post > MQTT_POSTINTERVAL_DHT22_SEC * 1000))
  {
    bool publishing = false;

    calc_sensor_stats(&tempSamples, &tempHistory);
    if(tempHistory.size() > 0)
    {
      publishing = publish_mqtt_data("TEMP", (mqtt_temp_topic+String(MAC_char)).c_str(),
                                     String(tempHistory.front()).c_str(), false);
    }

    calc_sensor_stats(&humidSamples, &humidHistory);
    if(humidHistory.size() > 0)
    {
      publishing = publish_mqtt_data("HUMID", (mqtt_humid_topic+String(MAC_char)).c_str(),
                                     String(humidHistory.front()).c_str(), false);
    }

    if (publishing)
      last_dht22_post = sinceStart;

    return publishing;
  }
#endif

  return false;
}

bool publish_mqtt_data(const char* type_publish, const char* topic, const char* payload, boolean retained)
{
#ifdef VERBOSE
  Serial.print("PUBLISH ");
  Serial.print(type_publish);
  Serial.print(": topic=");
  Serial.print(topic);
  Serial.print(" -> ");
  Serial.println(payload);
#endif
  return client.publish(topic, payload, retained);
}

bool publish_mqtt_binary_sensor(const char* name_on, const char* name_off,
                                bool state, const char* topic)
{
  if (state)
    return publish_mqtt_data(name_on, topic, "on", false);
  else
    return publish_mqtt_data(name_off, topic, "off", false);
}

void set_color_rgb(uint16_t red, uint16_t green, uint16_t blue)
{
#ifdef LED_RGB_RED
#ifdef USE_ESP32
  // hueToRGB(color, brightness);  // call function to convert hue to RGB
  // write the RGB values to the pins
  ledcWrite(1, (uint32_t)(red / 4)); // write red component to channel 1, etc.
  ledcWrite(2, (uint32_t)(green / 4));
  ledcWrite(3, (uint32_t)(blue / 4));
#else
  analogWrite(LED_RGB_RED, red);
  analogWrite(LED_RGB_GREEN, green);
  analogWrite(LED_RGB_BLUE, blue);
#endif
#endif
}

bool i_state_critical()
{
  switch (current_sensor_state)
  {
    case STATE_INIT:
    case STATE_OK_MEASURE:
    case STATE_OK_PUBLISH:
    case STATE_STANDBY:
    {
      return false;
    }
//    case STATE_WEBACCESS:
    case STATE_ERROR:
    case STATE_WARN:
    case STATE_CRITICAL:
    {
      return true;
    }
  }
}

void set_state(int new_state)
{
  current_sensor_state = new_state;
  last_state_change = sinceStart;

  // Set RGB LED state:
  switch (current_sensor_state)
  {
    case STATE_INIT:
    {
      set_color_rgb(1023, 1023, 1023);
      break;
    }
    case STATE_ERROR:
    {
#ifdef VERBOSE
      Serial.println("ERROR STATE (red)");
#endif
      set_color_rgb(1023, 0, 0);
      break;
    }
    case STATE_WARN:
    {
#ifdef VERBOSE
      Serial.println("WARNING STATE (R+.5G)");
#endif
      set_color_rgb(1023, 512, 0);
      break;
    }
    case STATE_CRITICAL:
    {
#ifdef VERBOSE
      Serial.println("CRITICAL STATE (violet)");
#endif
      set_color_rgb(0, 1023, 1023);
      break;
    }
    case STATE_OK_MEASURE:
    {
      set_color_rgb(0, 0, 1023);
      break;
    }
    case STATE_OK_PUBLISH:
    {
//      Serial.println("OK PUBLISH");
      set_color_rgb(0, 1023, 0);
      break;
    }
    case STATE_STANDBY:
    {
      set_color_rgb(0, 0, 0);
      break;
    }
  }
}

