azogue/hass_config/esp8266_sensors/mqtt_pir_vibro_light_dht22_publisher.c
void isr_pir_change()
{
  if (!pir_state && (sinceStart - last_pir_trigered > DELAY_MIN_MS_ENTRE_MOVS))
  {
    pir_state = HIGH;
    flag_publish_pir = HIGH;
  }
  last_pir_trigered = sinceStart;
}

void isr_vibro_change()
{
  if (!vibro_state && (sinceStart - last_vibro_trigered > DELAY_MIN_MS_ENTRE_VIBRO_SENSOR))
  {
    vibro_state = HIGH;
    flag_publish_vibro = HIGH;
  }
  last_vibro_trigered = sinceStart;
}

#ifdef PIN_LIGHT_SENSOR_DIGITAL
void isr_light_sensor_change()
{
  if (sinceStart - last_light_trigered > DELAY_MIN_MS_ENTRE_LIGHT_SENSOR)
  {
    bool new_light_state = digitalRead(PIN_LIGHT_SENSOR_DIGITAL);
    if (new_light_state != light_state)
    {
      light_state = !light_state;
      flag_publish_light = HIGH;
    }
  }
  last_light_trigered = sinceStart;
}
#endif

#ifdef PIN_LIGHT_SENSOR_ANALOG
float read_analog_light_percentage()
{
  float light_percentage;

  light_percentage = round(100. * (1023 - analogRead(PIN_LIGHT_SENSOR_ANALOG)) /  10.23) / 100.;
//#ifdef VERBOSE
//  Serial.print("LIGHT: ");
//  Serial.print(light_percentage);
//  Serial.println(" %");
//#endif
  return light_percentage;
}
#endif

void sample_dht22_sensor_data(bool *sampled, bool *sample_ok)
{
  *sampled = false;
  *sample_ok = false;

#ifdef DHTPIN
  // Collect the DHT22 sensor data
  if(sinceStart - last_dht_sensed > RESULTS_SAMPLE_RATE * 1000)
  {
    double temp = -999;
    double humid = -999;
    sensors_event_t event;

    *sampled = true;
    //Collect the temperature from a sensor.
    dht.temperature().getEvent(&event);
    if (!isnan(event.temperature))
    {
      temp = event.temperature;
#ifdef VERBOSE
      Serial.print("Temp: " + String(temp) + " ^C, ");
#endif
    }
    // Get humidity event and print its value.
    dht.humidity().getEvent(&event);
    if (!isnan(event.relative_humidity))
    {
      humid = event.relative_humidity;
#ifdef VERBOSE
      Serial.println("Humidity: " + String(humid) + " %");
#endif
    }

    if ((temp == -999) || (humid == -999))
    {
      sensor_t sensor;
#ifdef VERBOSE
      Serial.println("ERROR! " + String(temp) + " / " + String(humid));
#endif
      dht.begin();
      dht.temperature().getSensor(&sensor);
      last_sensor_error = sinceStart;
      error_counter_dht += 1;
      *sample_ok = false;
    }
    else
    {
      last_sensor_ok = sinceStart;
      *sample_ok = true;
      error_counter_dht = 0;

      //Make sure a valid temperature was sampled
      if(temp != -999)
        tempSamples.push_front(temp);

      if(humid != -999)
        humidSamples.push_front(humid);
    }

    last_dht_sensed = sinceStart;
  }
#endif
}

#ifdef DHTPIN
void calc_sensor_stats(std::list<double> *samples, std::list<double> *history)
{
  int count = 0;
  double tempsum = 0;
  double tempaverage;

  if(samples->size() > 0)
  {
    for(std::list<double>::iterator sensiter = samples->begin(); sensiter != samples->end(); sensiter++)
    {
      count++;
      tempsum += *sensiter;
    }
    tempaverage = tempsum / count;

    //Add the new data to the history.
    history->push_front(tempaverage);
    if(history->size() > SENSOR_HISTORY_RECORDS)
    {
      history->pop_back();
    }
  }
  samples->clear();
}
#endif

//**********************************
//** Setup methods
//**********************************
void setup_timers()
{
  sinceStart = 0;
  last_state_change = 0;
  last_sensor_error = 0;
  last_sensor_ok = 0;
  last_dht_sensed = 0;                //The last time a sample was taken from the DHT22 sensor.
  error_counter_dht = 1;
  last_dht22_post = 15000;            // Init value to wait some time before the 1st publish.
  last_light_post = 15000;            // Init value to wait some time before the 1st publish.
  flag_publish_light = HIGH;
}

void setup_leds()
{
#ifdef LED_BLUE_PIR
  pinMode(LED_BLUE_PIR, OUTPUT);
#endif
#ifdef LED_YELLOW_VIBRO
  pinMode(LED_YELLOW_VIBRO, OUTPUT);
#endif

#ifdef LED_RGB_RED
#ifdef USE_ESP32
  ledcAttachPin(LED_RGB_RED, 1); // assign RGB led pins to channels
  ledcAttachPin(LED_RGB_GREEN, 2);
  ledcAttachPin(LED_RGB_BLUE, 3);
  // Initialize channels
  // channels 0-15, resolution 1-16 bits, freq limits depend on resolution
  // ledcSetup(uint8_t channel, uint32_t freq, uint8_t resolution_bits);
  ledcSetup(1, 12000, 8); // 12 kHz PWM, 8-bit resolution
  ledcSetup(2, 12000, 8);
  ledcSetup(3, 12000, 8);
#else
  pinMode(LED_RGB_RED, OUTPUT);
  pinMode(LED_RGB_GREEN, OUTPUT);
  pinMode(LED_RGB_BLUE, OUTPUT);
#endif
#endif
}

#ifdef DHTPIN
void setup_temp_sensor()
{
  dht.begin();
  sensor_t sensor;
  dht.temperature().getSensor(&sensor);
#ifdef VERBOSE
  Serial.println("------------------------------------");
  Serial.println("Temperature");
  Serial.print  ("Sensor:       "); Serial.println(sensor.name);
  Serial.print  ("Driver Ver:   "); Serial.println(sensor.version);
  Serial.print  ("Unique ID:    "); Serial.println(sensor.sensor_id);
  Serial.print  ("Max Value:    "); Serial.print(sensor.max_value); Serial.println(" *C");
  Serial.print  ("Min Value:    "); Serial.print(sensor.min_value); Serial.println(" *C");
  Serial.print  ("Resolution:   "); Serial.print(sensor.resolution); Serial.println(" *C");
  Serial.println("------------------------------------");
#endif
  dht.humidity().getSensor(&sensor);
  // Print humidity sensor details.
  dht.humidity().getSensor(&sensor);
#ifdef VERBOSE
  Serial.println("------------------------------------");
  Serial.println("Humidity");
  Serial.print  ("Sensor:       "); Serial.println(sensor.name);
  Serial.print  ("Driver Ver:   "); Serial.println(sensor.version);
  Serial.print  ("Unique ID:    "); Serial.println(sensor.sensor_id);
  Serial.print  ("Max Value:    "); Serial.print(sensor.max_value); Serial.println("%");
  Serial.print  ("Min Value:    "); Serial.print(sensor.min_value); Serial.println("%");
  Serial.print  ("Resolution:   "); Serial.print(sensor.resolution); Serial.println("%");
  Serial.println("------------------------------------");
#endif
}
#endif

