azogue/hass_config/esp8266_sensors/mqtt_pir_vibro_light_dht22_publisher.c
void setup_boolean_sensors()
{
#ifdef PIN_PIR
  pinMode(PIN_PIR, INPUT);
  attachInterrupt(digitalPinToInterrupt(PIN_PIR), isr_pir_change, CHANGE);
#endif

#ifdef PIN_VIBRO
  pinMode(PIN_VIBRO, INPUT);
  attachInterrupt(digitalPinToInterrupt(PIN_VIBRO), isr_vibro_change, CHANGE);
#endif

#ifdef PIN_LIGHT_SENSOR_DIGITAL
  pinMode(PIN_LIGHT_SENSOR_DIGITAL, INPUT);
  attachInterrupt(digitalPinToInterrupt(PIN_LIGHT_SENSOR_DIGITAL), isr_light_sensor_change, CHANGE);
#endif

#ifdef PIN_LIGHT_SENSOR_ANALOG
  pinMode(PIN_LIGHT_SENSOR_ANALOG, INPUT);
#endif
}

void connectWiFi()
{
  //char *pass = (char*) malloc(strlen(WiFiPSK));
  //strcpy(pass, WiFiPSK);

  //WiFi.mode(WIFI_STA);
  //WiFi.begin(WiFiSSID, pass);
  WiFi.begin((char *)WiFiSSID, (const char *)WiFiPSK);


#ifdef VERBOSE
  Serial.print("Attempting to connect to WPA SSID: ");
  Serial.print(WiFiSSID);
#endif

  while (WiFi.status() != WL_CONNECTED)
  {
    set_color_rgb(1023, 0, 1023);
    //Delay until connected.
    delay(DELAY_MS_BETWEEN_RETRIES);
#ifdef VERBOSE
    Serial.print (".");
#endif
  }
  set_color_rgb(0, 1023, 0);
#ifdef VERBOSE
  Serial.println("You're connected to the network");
  printWifiStatus();
#endif

  //Connect to the mqtt server
  client.setServer(MQTT_SERVER, MQTT_PORT);
  set_state(STATE_STANDBY);
}

#ifdef VERBOSE
void printWifiStatus()
{
  // print the SSID of the network you're attached to
  Serial.print("SSID: ");
  Serial.println(WiFi.SSID());

  // print your WiFi shield's IP address
  IPAddress ip = WiFi.localIP();
  Serial.print("IP Address: ");
  Serial.println(ip);

#ifndef USE_ESP32
// print the received signal strength
  long rssi = WiFi.RSSI();
  Serial.print("Signal strength (RSSI):");
  Serial.print(rssi);
  Serial.println(" dBm");
#endif
}
#endif
